app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."published_at" DESC
---
  def index
    @articles = Article.order(published_at: :desc)

INSERT INTO "articles" ("title", "content", "author", "category", "published_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 999], ["LIMIT", 1]]
---
  def set_article
    @article = Article.find_by(id: params[:id])